Repository: Kun686/iTerm2-CN
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# ui.ptysession.ptysession.looks_like_mouse_reporting_was_left_on_when.b81ad94b
source: Looks like mouse reporting was left on when an ssh session ended unexpectedly or an app misbehaved. Turn it off?
zh_hans: ssh 会话意外结束或应用行为异常时，鼠标报告似乎仍处于开启状态。要将其关闭吗？

# ui.ptysession.ptysession.looks_like_resize_reporting_was_left_on_when.e19c406c
source: Looks like resize reporting was left on when an ssh session ended unexpectedly or an app misbehaved. Turn it off?
zh_hans: ssh 会话意外结束或应用行为异常时，窗口大小报告似乎仍处于开启状态。要将其关闭吗？

# ui.ptysession.ptysession.looks_like_the_selection_changed_and_is_no.e3c739ac
source: Looks like the selection changed and is no longer a valid JSON object. You can find this feature under Edit > Replace Selection > Replace with Pretty-Printed JSON if you want to try again.
zh_hans: 所选内容似乎已更改，不再是有效的 JSON 对象。 如果想重试，可在“编辑”>“替换所选内容”>“替换为格式化的 JSON”中找到此功能。

# ui.ptysession.ptysession.mark_set_in_session.064bef00
source: Mark set in session “%@.”
zh_hans: 已在会话“%@”中设置标记。

# ui.ptysession.ptysession.mark_set_notification_body
source: Session %1$@ #%2$d had a mark set.
zh_hans: 会话 %1$@ #%2$d 已设置标记。

# ui.ptysession.ptysession.mark_set_notification_title
source: Mark Set
zh_hans: 已设置标记

# ui.ptysession.ptysession.match_key_bindings_by_physical_key.edd8ade7
source: Match key bindings by physical key?
zh_hans: 要按物理按键匹配按键绑定吗？

# ui.ptysession.ptysession.never.6300ef80
source: Never
zh_hans: 从不

# ui.ptysession.ptysession.no.1ea442a1
source: No
zh_hans: 否

# ui.ptysession.ptysession.not_now.ccb4c324
source: Not Now
zh_hans: 暂不

# ui.ptysession.ptysession.ok.565339bc
source: OK
zh_hans: 好

# ui.ptysession.ptysession.ok.c758dc39
source: _OK
zh_hans: 好(_O)

# ui.ptysession.ptysession.open_settings.76480893
source: _Open Settings
zh_hans: 打开设置(_O)

# ui.ptysession.ptysession.pause_settings.df4b1de4
source: _Pause Settings
zh_hans: 暂停设置(_P)

# ui.ptysession.ptysession.pause_tmux_pane.244c046b
source: Pause tmux Pane
zh_hans: 暂停 tmux 窗格

# ui.ptysession.ptysession.permission_required.9922fe9b
source: Permission Required
zh_hans: 需要权限

# ui.ptysession.ptysession.please_wait_for_the_current_upload_to_complete.5fd9fc07
source: Please wait for the current upload to complete or cancel it before starting another.
zh_hans: 请等待当前上传完成，或先取消上传再开始新的上传。

# ui.ptysession.ptysession.remote_host.2be8521b
source: remote host
zh_hans: 远程主机

# ui.ptysession.ptysession.reveal.36b830bd
source: Reveal
zh_hans: 显示

# ui.ptysession.ptysession.reveal_setting.bceec044
source: Reveal Setting
zh_hans: 显示设置

# ui.ptysession.ptysession.right.27042f4e
source: right
zh_hans: 右侧

# ui.ptysession.ptysession.run_command_trigger_failed_notification_title
source: Run Command Trigger Failed
zh_hans: 运行命令触发器失败

# ui.ptysession.ptysession.run_installer_anyway.9d92bd7c
source: Run Installer Anyway
zh_hans: 仍要运行安装程序

# ui.ptysession.ptysession.second.16367aac
source: second
zh_hans: 秒

# ui.ptysession.ptysession.seconds.59f006d6
source: seconds
zh_hans: 秒

# ui.ptysession.ptysession.select_a_profile_to_use_for_this_session.80dcc6c0
source: Select a profile to use for this session. Your selection will be saved back to the arrangement.
zh_hans: 选择此会话要使用的配置文件。所选配置会保存回窗口布局。

# ui.ptysession.ptysession.session_paused.fbb07a36
source: Session paused.
zh_hans: 会话已暂停。

# ui.ptysession.ptysession.settings.7a04083b
source: Settings…
zh_hans: 设置…

# ui.ptysession.ptysession.settings.e51e4d47
source: _Settings
zh_hans: 设置(_S)

# ui.ptysession.ptysession.share_clipboard_contents_with_app_in_terminal.6e9168fc
source: Share clipboard contents with app in terminal?
zh_hans: 要与终端中的应用共享剪贴板内容吗？

# ui.ptysession.ptysession.show_it.5c8369bf
source: Show It
zh_hans: 显示

# ui.ptysession.ptysession.show_session.76773bac
source: Show Session
zh_hans: 显示会话

# ui.ptysession.ptysession.silence_automatically.63fab2fa
source: Silence Automatically
zh_hans: 自动静音

# ui.ptysession.ptysession.silence_bell_temporarily.6dfa68c0
source: _Silence Bell Temporarily
zh_hans: 暂时将铃声静音(_S)

# ui.ptysession.ptysession.silence_warning.b6f4307c
source: Silence Warning
zh_hans: 不再警告

# ui.ptysession.ptysession.skip_this_dialog_in_the_future_and_send.63818bd0
source: Skip this dialog in the future and send the prompt immediately.
zh_hans: 以后跳过此对话框并立即发送提示词。

# ui.ptysession.ptysession.slow_tmux_response.abc49397
source: Slow tmux Response
zh_hans: tmux 响应缓慢

# ui.ptysession.ptysession.stop_asking.ba90d712
source: Stop Asking
zh_hans: 不再询问

# ui.ptysession.ptysession.suppress_all_output.8852c171
source: Suppress _All Output
zh_hans: 抑制所有输出(_A)

# ui.ptysession.ptysession.tar_failed_with_this_message.03dbcaad
source: tar failed with this message: %@
zh_hans: tar 失败并返回以下信息：%@

# ui.ptysession.ptysession.terminal_notification_body
source: Session %1$@ #%2$d: %3$@
zh_hans: 会话 %1$@ #%2$d：%3$@

# ui.ptysession.ptysession.the_bell_is_ringing_a_lot_silence_it.4acfc875
source: The bell is ringing a lot. Silence it?
zh_hans: 终端铃声频繁响起。要将其静音吗？

# ui.ptysession.ptysession.the_bell_is_ringing_a_lot_want_to.261cd33e
source: The bell is ringing a lot. Want to suppress all output until things calm down?
zh_hans: 终端铃声频繁响起。要在情况缓和前抑制所有输出吗？

# ui.ptysession.ptysession.the_download_is_larger_than_continue.a01a4e29
source: The download “%@” is larger than %@. Continue?
zh_hans: 下载项“%@”大于 %@。要继续吗？

source: The key-binding action Copy Interpolated String “%@” failed: %@
zh_hans: 按键绑定操作“复制插值字符串（%@）”失败： %@

# ui.ptysession.ptysession.the_selected_text_was_rather_long.247a0467
source: ⚠️ The selected text was rather long.
zh_hans: ⚠️ 所选文本较长。

source: The shell for this account, “%@”, does not exist. Change the profile to use /bin/zsh instead?
zh_hans: 此账户的 Shell“%@”不存在。要将配置文件改为使用 /bin/zsh 吗？

source: The terminal attempted to access the clipboard but it was denied. Enable clipboard access in “Settings > General > Selection > Applications in terminal may access clipboard”.
zh_hans: 终端尝试访问剪贴板，但访问被拒绝。请在“设置 > 通用 > 选择 > 允许终端中的应用访问剪贴板”中启用剪贴板访问。

source: The terminal has initiated display of a file named “%@” of size %@. Allow it?
zh_hans: 终端发起了显示文件“%@”（大小：%@）的请求。要允许吗？

source: The terminal has initiated transfer of a file named “%@” of size %@. Download it?
zh_hans: 终端发起了传输文件“%@”（大小：%@）的请求。要下载吗？

source: This account’s Shell Integration scripts are out of date.
zh_hans: 此账户的 Shell 集成脚本已过期。

# ui.ptysession.ptysession.this_instance_of_iterm2_is_already_attached_to.0ee3dab3
source: This instance of iTerm2 is already attached to this session
zh_hans: 此 iTerm2 实例已连接到该会话

# ui.ptysession.ptysession.this_key_now_types_a_different_character_match.07ec6eb3
source: This key now types a different character. Match key bindings by physical key?
zh_hans: 此按键现在会输入不同的字符。要按物理按键匹配键绑定吗？

source: This session will pause in about %@ %@ because it is buffering too much data.
zh_hans: 此会话将在约 %@ %@后暂停，因为缓冲的数据过多。

# ui.ptysession.ptysession.tmux_is_not_responding_would_you_like_to.24608f20
source: Tmux is not responding. Would you like to force detach?
zh_hans: tmux 没有响应。要强制断开吗？

source: tmux paused this session because too much output was buffered.
zh_hans: tmux 因缓冲的输出过多而暂停了此会话。

# ui.ptysession.ptysession.trigger_notification_body
source: A trigger fired in session “%1$@” in tab #%2$d.
zh_hans: 会话“%1$@”（标签页 #%2$d）触发了触发器。

# ui.ptysession.ptysession.unnamed_trigger.faf6093f
source: (Unnamed trigger)
zh_hans: （未命名触发器）

# ui.ptysession.ptysession.unpause.6a973c00
source: _Unpause
zh_hans: 取消暂停(_U)

# ui.ptysession.ptysession.unpause_tmux_pane.bad27ad1
source: Unpause tmux Pane
zh_hans: 继续运行 tmux 窗格

# ui.ptysession.ptysession.upgrade.7ec0261b
source: Upgrade
zh_hans: 升级

# ui.ptysession.ptysession.upload_in_progress.58658f87
source: Upload in Progress
zh_hans: 正在上传

# ui.ptysession.ptysession.use_physical_key.7006d8c1
source: Use Physical Key
zh_hans: 使用物理按键

# ui.ptysession.ptysession.view_errors.58994c0a
source: _View Errors
zh_hans: 查看错误(_V)

# ui.ptysession.ptysession.wants_to_control_iterm2_using_the_api_over.167e2704
source: %@ wants to control iTerm2 using the API over SSH integration. The API can view and modify iTerm2’s contents. Allow it for this session?
zh_hans: %@ 希望通过 SSH 集成使用 API 控制 iTerm2。该 API 可以查看和修改 iTerm2 的内容。要在此会话中允许吗？

# ui.ptysession.ptysession.wants_to_load_a_url_in_this_browser_session.0ee964fc
source: %@ wants to load a URL in this browser session.
zh_hans: %@想要在此浏览器会话中加载 URL。

# ui.ptysession.ptysession.warning_this_profile_uses_a_custom_locale_that.550ec792
source: Warning! This profile uses a custom locale that doesn't use UTF-8 as its character encoding, but your profile *is* using UTF-8. This can cause error messages and non-ASCII text to appear wrong.
zh_hans: 警告！此配置文件使用自定义区域设置，其字符编码不是 UTF-8，但配置文件本身使用 UTF-8。这可能导致错误信息和非 ASCII 文本显示异常。

source: When mouse reporting is on, horizontal scrolling does not switch tabs. Hold option while swiping or disable horizontal scroll reporting to switch tabs.
zh_hans: 启用鼠标报告时，水平滚动不会切换标签页。 滑动时按住 Option 键，或停用水平滚动报告，即可切换标签页。

# ui.ptysession.ptysession.wrong_encoding_detected.446992aa
source: Wrong Encoding Detected
zh_hans: 检测到错误的编码

# ui.ptysession.ptysession.yes.85a39ab3
source: Yes
zh_hans: 是

# ui.ptysession.ptysession.yes.b481b415
source: _Yes
zh_hans: 是(_Y)

# ui.ptysession.ptysession.you_can_find_this_feature_under_edit_replace.ae2bcef9
source: You can find this feature under Edit > Replace Selection > Replace with Pretty-Printed JSON if you want to use it again.
zh_hans: 如果以后想再次使用此功能，可在“编辑”>“替换所选内容”>“替换为格式化的 JSON”中找到它。

# ui.ptysession.ptysession.you_seem_frustrated_would_you_like_the_option.3fe759ba
source: You seem frustrated. Would you like the %@ option key to send esc+keystroke?
zh_hans: 你似乎遇到了问题。要让%@ Option 键发送 Esc+按键吗？

# ui.ptysession.ptysession.bell_notification_body
source: Session %1$@ #%2$d just rang a bell!
zh_hans: 会话 %1$@ #%2$d 刚刚响铃！

# ui.ptysession.ptysession.bell_notification_title
source: Bell
zh_hans: 响铃

# ui.ptysession.ptysession.profile_updated_notification_title
source: Profile Updated
zh_hans: 配置文件已更新

# ui.ptysession.ptysession.session_buried_notification_body
source: It can be restored by detaching from tmux, or from the Sessions > Buried Sessions menu.
zh_hans: 可通过断开 tmux 会话，或从“会话”>“已隐藏的会话”菜单恢复。

# ui.ptysession.ptysession.session_buried_notification_title
source: Session Buried
zh_hans: 会话已隐藏

# ui.ptysession.ptysession.session_ended_notification_body
source: Session "%1$@" in tab #%2$d just terminated.
zh_hans: 标签页 #%2$d 中的会话“%1$@”刚刚终止。

# ui.ptysession.ptysession.session_ended_notification_title
source: Session Ended
zh_hans: 会话已结束

# ui.ptysession.ptysession.session_updated_notification_title
source: Session Updated
zh_hans: 会话已更新

# ui.ptysession.ptysession.status_notification_body
source: Status changed to “%@”
zh_hans: 状态已更改为“%@”

# ui.ptysession.ptysession.status_notification_title
source: Session “%@”
zh_hans: 会话“%@”

# ui.ptysession.ptysession.triggers_disabled_for_profile_notification_body
source: Triggers disabled in interactive apps. You can change this in Settings > Profiles > Advanced.
zh_hans: 已在交互式应用中停用触发器。可在“设置”>“配置文件”>“高级”中更改此设置。

# ui.ptysession.ptysession.triggers_disabled_for_session_notification_body
source: Triggers disabled in interactive apps. You can change this in Edit Session > Advanced.
zh_hans: 已在交互式应用中停用触发器。可在“编辑会话”>“高级”中更改此设置。

source: Cannot start logging to session with profile “%@”: %@
zh_hans: 无法开始记录使用配置文件“%@”的会话：%@

# ui.ptysession.ptysession_arc.ok.565339bc
source: OK
zh_hans: 好

# ui.ptysession.ptysession_arc.session_logging_problem.bc17f23b
source: Session Logging Problem
zh_hans: 会话日志出现问题

# ui.regex_visualization.parse_error
source: The regular expression could not be parsed.
zh_hans: 无法解析正则表达式。

# ui.searchingfiltering.itermsearchfieldcell.search.49c266ba
source: Search
zh_hans: 搜索

# ui.semantichistory.itermsemantichistorycontroller.ok.565339bc
source: OK
zh_hans: 好

source: Semantic History Command Failed
zh_hans: 语义历史命令失败

source: The following command returned a non-zero exit code: “%@”
zh_hans: 以下命令返回了非零退出代码： “%@”

# ui.semantichistory.itermsemantichistorycontroller.view.dcc839a4
source: View
zh_hans: 显示

# ui.semantichistory.itermurlactionhelper.cancel.19766ed6
source: Cancel
zh_hans: 取消

source: Enter username for host %@ to download file with scp
zh_hans: 输入主机 %@ 的用户名，以使用 scp 下载文件

# ui.semantichistory.itermurlactionhelper.ok.565339bc
source: OK
zh_hans: 好

source: URL Handler Command Failed
zh_hans: URL 处理程序命令失败

source: Couldn’t find the specified font “%@” or the fallback standard fixed-pitch font, Menlo. Please ensure at least one of these is installed.
zh_hans: 找不到指定字体“%@”，也找不到后备标准等宽字体 Menlo。请确保至少安装了其中一种字体。

# ui.sessioncreation.itermsessionlauncher.illegal_username.067c71af
source: Illegal Username
zh_hans: 用户名无效

# ui.sessioncreation.itermsessionlauncher.invalid_profile.cb2a119d
source: Invalid Profile
zh_hans: 配置文件无效

# ui.sessioncreation.itermsessionlauncher.ok.565339bc
source: OK
zh_hans: 好

source: The SSH user name “%@” contained a disallowed character. The set of allowed characters is limited for security reasons. You can modify it in Settings > Advanced > Valid characters in SSH user names.
zh_hans: SSH 用户名“%@”包含不允许的字符。出于安全原因，只允许使用有限的字符集。您可以在“设置 > 高级 > SSH 用户名中的有效字符”中修改。

# ui.settings.appearancepreferencesviewcontroller.cancel.19766ed6
source: Cancel
zh_hans: 取消

source: Exclude From Dock and App Switcher
zh_hans: 不在程序坞和应用切换器中显示

source: When iTerm2 is excluded from the dock, you can always get back to Preferences using the status bar item. Look for an iTerm2 icon on the right side of your menu bar.
zh_hans: 当 iTerm2 不显示在程序坞中时，仍可通过状态栏项目返回“设置”。请在菜单栏右侧查找 iTerm2 图标。

source: Copy these settings from profile “%@”:
zh_hans: 从配置文件“%@”复制以下设置：

source: Leave empty to copy matching text
zh_hans: 留空以复制匹配文本

# ui.settings.contextmenuactionprefscontroller.untitled_action.86725a8c
source: Untitled Action
zh_hans: 未命名操作

source: You can use captured strings from the Smart Selection's regular expression in the parameter. Use \0 for match, \1…\9 for match groups, \d for directory, \u for user, \h for host.
zh_hans: 可在参数中使用智能选择正则表达式捕获的字符串。使用 \0 表示匹配项，\1…\9 表示匹配组，\d 表示目录，\u 表示用户，\h 表示主机。

# ui.settings.eventmonitorview.you_can_t_customize_that_button.3a653f97
source: You can't customize that button
zh_hans: 无法自定义该按钮

source: A check for AI model updates is already in progress.
zh_hans: 正在检查 AI 模型更新。

source: A newer AI model list was downloaded. It will take effect the next time you launch iTerm2.
zh_hans: 已下载较新的 AI 模型列表。它将在下次启动 iTerm2 时生效。

# ui.settings.generalpreferencesviewcontroller.add.9fd728c6
source: Add
zh_hans: 添加

# ui.settings.generalpreferencesviewcontroller.add_manual_ai_model.d172c364
source: Add Manual AI Model
zh_hans: 添加手动 AI 模型

source: AI model updates are turned off in Advanced Settings (the update URL is empty).
zh_hans: 已在高级设置中关闭 AI 模型更新（更新 URL 为空）。

# ui.settings.generalpreferencesviewcontroller.api_key.551ed668
source: %@ API key
zh_hans: %@ API 密钥

source: Authorizes with your %@ API key.
zh_hans: 使用您的 %@ API 密钥进行认证。

# ui.settings.generalpreferencesviewcontroller.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.settings.generalpreferencesviewcontroller.checking_plugin_status.97d29de1
source: Checking plugin status…
zh_hans: 正在检查插件状态…

# ui.settings.generalpreferencesviewcontroller.configurable_thinking.cb5c80d5
source: Configurable thinking
zh_hans: 可配置思考模式

# ui.settings.generalpreferencesviewcontroller.connection_failed.42aa4e7b
source: Connection Failed
zh_hans: 连接失败

# ui.settings.generalpreferencesviewcontroller.connection_succeeded.c1c12eda
source: Connection Succeeded
zh_hans: 连接成功

# ui.settings.generalpreferencesviewcontroller.context_tokens.f0c7a018
source: Context tokens:
zh_hans: 上下文 Token 数：

source: Context tokens must be greater than zero.
zh_hans: 上下文 Token 数必须大于零。

# ui.settings.generalpreferencesviewcontroller.copy.e21f935f
source: Copy
zh_hans: 拷贝

source: Copy local settings to custom folder now?
zh_hans: 现在将本地设置复制到自定义文件夹吗？

source: Couldn’t check for AI model updates. Please try again later.
zh_hans: 无法检查 AI 模型更新。请稍后重试。

# ui.settings.generalpreferencesviewcontroller.custom.494ca78f
source: Custom
zh_hans: 自定义

source: Custom header name “%@” is not valid. Use only RFC 7230 token characters (letters, digits, and any of !#$%%&'*+-.^_`|~).
zh_hans: 自定义标头名称“%@”无效。只能使用 RFC 7230 Token 字符（字母、数字以及 !#$%%&'*+-.^_`|~ 中的字符）。

# ui.settings.generalpreferencesviewcontroller.custom_headers.60821357
source: Custom headers:
zh_hans: 自定义标头：

source: Custom Headers Are Now Set Per Model
zh_hans: 自定义标头现按模型设置

# ui.settings.generalpreferencesviewcontroller.disabled.75081b59
source: Disabled
zh_hans: 已禁用

# ui.settings.generalpreferencesviewcontroller.don_t_copy.36ca587f
source: Don’t Copy
zh_hans: 不复制

# ui.settings.generalpreferencesviewcontroller.economy_model.fa5f8d9e
source: Economy model
zh_hans: 经济型模型

# ui.settings.generalpreferencesviewcontroller.edit_manual_ai_model.6c0acb99
source: Edit Manual AI Model
zh_hans: 编辑手动 AI 模型

source: Enable for reasoning models with a thinking mode, such as GPT-5, o-series, or DeepSeek models, so the chat’s Think toggle appears.
zh_hans: 为具有思考模式的推理模型启用，例如 GPT-5、o 系列或 DeepSeek 模型，以便在聊天中显示“思考”开关。

source: Enter a model name and URL before testing the connection.
zh_hans: 请先输入模型名称和 URL，再测试连接。

# ui.settings.generalpreferencesviewcontroller.function_calling.c5caadc9
source: Function calling
zh_hans: 函数调用

# ui.settings.generalpreferencesviewcontroller.header.ba5caa42
source: Header
zh_hans: 标头

# ui.settings.generalpreferencesviewcontroller.hosted_code_interpreter.310badc6
source: Hosted code interpreter
zh_hans: 托管代码解释器

# ui.settings.generalpreferencesviewcontroller.hosted_file_search.5cc595ed
source: Hosted file search
zh_hans: 托管文件搜索

# ui.settings.generalpreferencesviewcontroller.hosted_web_search.99fd03fa
source: Hosted web search
zh_hans: 托管网页搜索

# ui.settings.generalpreferencesviewcontroller.install.8c1df2d5
source: Install…
zh_hans: 安装…

# ui.settings.generalpreferencesviewcontroller.invalid_manual_ai_model.9c87edfe
source: Invalid Manual AI Model
zh_hans: 无效的手动 AI 模型

source: Keys are stored securely in the macOS Keychain.
zh_hans: 密钥安全地存储在 macOS 钥匙串中。

# ui.settings.generalpreferencesviewcontroller.manage_ai_api_keys.a84e4221
source: Manage AI API Keys
zh_hans: 管理 AI API 密钥

# ui.settings.generalpreferencesviewcontroller.manual_ai_models.2e3927a8
source: Manual AI Models
zh_hans: 手动 AI 模型

source: Manual model names must be unique.
zh_hans: 手动模型名称必须唯一。

# ui.settings.generalpreferencesviewcontroller.max_response_tokens.1fb887a2
source: Max response tokens:
zh_hans: 最大响应 Token 数：

source: Max response tokens must be greater than zero.
zh_hans: 最大响应 Token 数必须大于零。

# ui.settings.generalpreferencesviewcontroller.missing_information.d0f98531
source: Missing Information
zh_hans: 信息不完整

# ui.settings.generalpreferencesviewcontroller.model.11a93106
source: Model:
zh_hans: 模型：

# ui.settings.generalpreferencesviewcontroller.model_is_required.8d9885c3
source: Model is required.
zh_hans: 必须填写模型。

# ui.settings.generalpreferencesviewcontroller.no_api_key_is_used.0ba9ed8e
source: No API key is used.
zh_hans: 不使用 API 密钥。

# ui.settings.generalpreferencesviewcontroller.ok.565339bc
source: OK
zh_hans: 好

# ui.settings.generalpreferencesviewcontroller.open_system_preferences.75bdba5e
source: Open System Preferences
zh_hans: 打开“系统偏好设置”

# ui.settings.generalpreferencesviewcontroller.open_system_settings.18196b39
source: Open System Settings
zh_hans: 打开“系统设置”

source: Plugin installed and working ✅
zh_hans: 插件已安装并正常工作 ✅

# ui.settings.generalpreferencesviewcontroller.preset.4336d942
source: Preset:
zh_hans: 预设：

source: Problem Erasing Settings and Data
zh_hans: 抹掉设置和数据时出现问题

# ui.settings.generalpreferencesviewcontroller.problem_exporting.3a0c59c1
source: Problem Exporting
zh_hans: 导出时出现问题

# ui.settings.generalpreferencesviewcontroller.problem_importing.9c3dc89a
source: Problem Importing
zh_hans: 导入时出现问题

# ui.settings.generalpreferencesviewcontroller.reveal_in_finder.cc849385
source: Reveal in Finder
zh_hans: 在 Finder 中显示

# ui.settings.generalpreferencesviewcontroller.save.1509f561
source: Save
zh_hans: 保存

# ui.settings.generalpreferencesviewcontroller.streaming_responses.43e6eb6d
source: Streaming responses
zh_hans: 流式响应

# ui.settings.generalpreferencesviewcontroller.supports_temperature.c03778d1
source: Supports temperature
zh_hans: 支持温度参数

source: System window restoration has been disabled, which prevents iTerm2 from respecting this setting. Disable System Settings > General > Close windows when quitting an app to enable window restoration.
zh_hans: 系统窗口恢复功能已被停用，因此 iTerm2 无法遵循此设置。请停用“系统设置 > 通用 > 退出应用时关闭窗口”，以启用窗口恢复。

source: System window restoration has been disabled, which prevents iTerm2 from respecting this setting. Disable ”System Settings > Desktop & Dock > Close windows when quitting an application“ to enable window restoration.
zh_hans: 系统窗口恢复功能已被停用，因此 iTerm2 无法遵循此设置。请停用“系统设置 > 桌面与程序坞 > 退出应用程序时关闭窗口”，以启用窗口恢复。

# ui.settings.generalpreferencesviewcontroller.test_connection.c02977b0
source: Test Connection
zh_hans: 测试连接

# ui.settings.generalpreferencesviewcontroller.testing.407b7a04
source: Testing…
zh_hans: 正在测试…

source: The existence of buried sessions disables opening a window at startup.
zh_hans: 存在已隐藏的会话时，将不会在启动时打开窗口。

source: The existence of hotkey windows disables opening a window at startup.
zh_hans: 存在热键窗口时，将不会在启动时打开窗口。

source: The presence of auto-launch scripts disables opening a window at startup.
zh_hans: 存在自动启动脚本时，将不会在启动时打开窗口。

source: The prompt must contain the substring %@. %@
zh_hans: 提示词必须包含子字符串 %@。%@

source: The value for custom header “%@” must not contain newline or null characters.
zh_hans: 自定义标头“%@”的值不得包含换行符或空字符。

source: Turn on AI features before checking for model updates.
zh_hans: 请先启用 AI 功能，再检查模型更新。

source: Uncheck for models that reject a temperature parameter, such as Anthropic Opus 4.7 and later.
zh_hans: 对于不接受温度参数的模型（如 Anthropic Opus 4.7 及更高版本），请取消选中。

# ui.settings.generalpreferencesviewcontroller.url_is_required.c9689eeb
source: URL is required.
zh_hans: URL 为必填项。

# ui.settings.generalpreferencesviewcontroller.value.8e37953d
source: Value
zh_hans: 值

# ui.settings.generalpreferencesviewcontroller.vector_store.c25dfe73
source: Vector store:
zh_hans: 向量存储：

source: Window Restoration Disabled
zh_hans: 窗口恢复已停用

source: You must restart iTerm2 for this change to take effect.
zh_hans: 必须重新启动 iTerm2，此更改才会生效。

source: Your AI custom HTTP headers used to be a single global setting. They still apply to your current model, but adding or editing models here does not carry them over. Re-add the headers you need in each model’s “Custom headers” section.
zh_hans: AI 自定义 HTTP 标头以前是一项全局设置。它们仍适用于当前模型，但在此添加或编辑模型时不会自动带入。请在每个模型的“自定义标头”部分重新添加所需标头。

source: Your AI model list is already up to date.
zh_hans: AI 模型列表已是最新版本。

# ui.settings.itermactionseditingviewcontroller.error_saving_to.9c1965ed
source: Error saving to %@: %@
zh_hans: 保存到 %@ 时出错：%@

# ui.settings.itermactionseditingviewcontroller.export_failed.9a5e4d95
source: Export Failed
zh_hans: 导出失败

# ui.settings.itermactionseditingviewcontroller.import_failed.09876dab
source: Import Failed
zh_hans: 导入失败

# ui.settings.itermactionseditingviewcontroller.malformed_file_at.7dee9e42
source: Malformed file at %@
zh_hans: %@ 处的文件格式不正确

# ui.settings.itermactionseditingviewcontroller.ok.565339bc
source: OK
zh_hans: 好

# ui.settings.itermactionseditingviewcontroller.while_loading.6d2b4144
source: While loading %@: %@
zh_hans: 加载 %@ 时出错：%@

# ui.settings.itermactionseditingviewcontroller.while_parsing.e18bb6fb
source: While parsing %@: %@
zh_hans: 解析 %@ 时出错：%@

# ui.settings.itermaddtriggerviewcontroller.action.7d9fda4e
source: Action:
zh_hans: 操作：

# ui.settings.itermaddtriggerviewcontroller.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.settings.itermaddtriggerviewcontroller.content_regex.8b83d0f7
source: Content Regex:
zh_hans: 内容正则表达式：
